#### Plan Output:
<details>

```bash
module.lambda.null_resource.install_python_dependencies: Refreshing state... [id=4543709504766974302]
module.lambda-accounts.null_resource.install_python_dependencies: Refreshing state... [id=5913568364995122719]
module.lambda-scan.null_resource.install_python_dependencies: Refreshing state... [id=980172503461919411]
module.lambda-slack.null_resource.install_python_dependencies: Refreshing state... [id=7855684661557853489]
module.accounts-role.aws_iam_role.lambda: Refreshing state... [id=domain-protect-accounts-dev]
module.lambda-role.aws_iam_role.lambda: Refreshing state... [id=domain-protect-lambda-dev]
module.step-function-role.aws_iam_role.lambda: Refreshing state... [id=domain-protect-state-dev]
module.kms.aws_kms_key.encryption: Refreshing state... [id=aa68da89-d5b6-4754-a875-91b34d310d66]
module.kms.aws_kms_alias.encryption: Refreshing state... [id=alias/domain-protect-dev]
module.sns.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-central-1:650869176880:domain-protect-dev]
module.lambda-role.aws_iam_role_policy.lambda: Refreshing state... [id=domain-protect-lambda-dev:domain-protect-lambda-dev]
module.sns-dead-letter-queue.aws_sns_topic.sns_topic: Refreshing state... [id=arn:aws:sns:eu-central-1:650869176880:domain-protect-dlq-dev]
module.step-function-role.aws_iam_role_policy.lambda: Refreshing state... [id=domain-protect-state-dev:domain-protect-state-dev]
module.step-function.aws_cloudwatch_log_group.log_group_for_sfn: Refreshing state... [id=/aws/vendedlogs/states/domain-protect-scan-dev]
module.dynamodb.aws_dynamodb_table.vulnerable_domains: Refreshing state... [id=DomainProtectVulnerableDomainsDev]
module.lambda-slack.aws_lambda_function.lambda[0]: Refreshing state... [id=domain-protect-slack-monitoring-dev]
module.lambda.aws_lambda_function.lambda["update"]: Refreshing state... [id=domain-protect-update-dev]
module.lambda.aws_lambda_function.lambda["current"]: Refreshing state... [id=domain-protect-current-dev]
module.lambda-scan.aws_lambda_function.lambda["scan"]: Refreshing state... [id=domain-protect-scan-dev]
module.step-function.aws_sfn_state_machine.state_machine: Refreshing state... [id=arn:aws:states:eu-central-1:650869176880:stateMachine:domain-protect-scan-dev]
module.lambda-scan.aws_lambda_alias.lambda["scan"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-scan-dev:domain-protect-scan-dev]
module.cloudwatch-event.aws_cloudwatch_event_rule.scheduled_event["current"]: Refreshing state... [id=domain-protect-current-dev]
module.lambda.aws_lambda_alias.lambda["current"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-current-dev:domain-protect-current-dev]
module.lambda.aws_lambda_alias.lambda["update"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-update-dev:domain-protect-update-dev]
module.cloudwatch-event.aws_cloudwatch_event_rule.scheduled_event["update"]: Refreshing state... [id=domain-protect-update-dev]
module.lambda-slack.aws_lambda_permission.sns[0]: Refreshing state... [id=AllowExecutionFromSNS]
module.lambda-slack.aws_lambda_alias.lambda[0]: Refreshing state... [id=arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-slack-monitoring-dev:domain-protect-slack-monitoring-dev]
module.lambda-slack.aws_sns_topic_subscription.lambda_subscription[0]: Refreshing state... [id=arn:aws:sns:eu-central-1:650869176880:domain-protect-dev:a3754b23-586c-4ed8-b81c-d857c0123cee]
module.cloudwatch-event.aws_lambda_permission.allow_cloudwatch_to_invoke_lambda["current"]: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.cloudwatch-event.aws_lambda_permission.allow_cloudwatch_to_invoke_lambda["update"]: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.cloudwatch-event.aws_cloudwatch_event_target.scheduled_event["current"]: Refreshing state... [id=domain-protect-current-dev-lambda]
module.cloudwatch-event.aws_cloudwatch_event_target.scheduled_event["update"]: Refreshing state... [id=domain-protect-update-dev-lambda]
module.accounts-role.aws_iam_role_policy.lambda: Refreshing state... [id=domain-protect-accounts-dev:domain-protect-accounts-dev]
module.lambda-accounts.aws_lambda_function.lambda["accounts"]: Refreshing state... [id=domain-protect-accounts-dev]
module.accounts-event.aws_cloudwatch_event_rule.scheduled_event["accounts"]: Refreshing state... [id=domain-protect-accounts-dev]
module.lambda-accounts.aws_lambda_alias.lambda["accounts"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-accounts-dev:domain-protect-accounts-dev]
module.accounts-event.aws_lambda_permission.allow_cloudwatch_to_invoke_lambda["accounts"]: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.accounts-event.aws_cloudwatch_event_target.scheduled_event["accounts"]: Refreshing state... [id=domain-protect-accounts-dev-lambda]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.lambda.aws_lambda_function.lambda["current"] has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-current-dev"
        tags                           = {}
        # (22 unchanged attributes hidden)


      ~ environment {
          - variables = {
              - "ALLOWED_REGIONS"          = "['eu-central-1', 'eu-west-1', 'us-east-1']"
              - "EXTERNAL_ID"              = ""
              - "IP_TIME_LIMIT"            = "48"
              - "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              - "PROJECT"                  = "domain-protect"
              - "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              - "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              - "TERRAFORM_WORKSPACE"      = "dev"
            } -> null
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.lambda["update"] has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-update-dev"
        tags                           = {}
        # (22 unchanged attributes hidden)


      ~ environment {
          - variables = {
              - "ALLOWED_REGIONS"          = "['eu-central-1', 'eu-west-1', 'us-east-1']"
              - "EXTERNAL_ID"              = ""
              - "IP_TIME_LIMIT"            = "48"
              - "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              - "PROJECT"                  = "domain-protect"
              - "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              - "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              - "TERRAFORM_WORKSPACE"      = "dev"
            } -> null
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-accounts.aws_lambda_function.lambda["accounts"] has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-accounts-dev"
        tags                           = {}
        # (22 unchanged attributes hidden)


      ~ environment {
          - variables = {
              - "EXTERNAL_ID"              = ""
              - "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              - "PROJECT"                  = "domain-protect"
              - "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              - "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              - "STATE_MACHINE_ARN"        = "arn:aws:states:eu-central-1:650869176880:stateMachine:domain-protect-scan-dev"
              - "TERRAFORM_WORKSPACE"      = "dev"
            } -> null
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-scan.aws_lambda_function.lambda["scan"] has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-scan-dev"
        tags                           = {}
        # (22 unchanged attributes hidden)


      ~ environment {
          - variables = {
              - "BUGCROWD"                 = "disabled"
              - "BUGCROWD_API_KEY"         = ""
              - "BUGCROWD_EMAIL"           = ""
              - "BUGCROWD_STATE"           = "unresolved"
              - "EXTERNAL_ID"              = ""
              - "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              - "PRODUCTION_WORKSPACE"     = "prd"
              - "PROJECT"                  = "domain-protect"
              - "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              - "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              - "TERRAFORM_WORKSPACE"      = "dev"
            } -> null
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-slack.aws_lambda_function.lambda[0] has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-slack-monitoring-dev"
        tags                           = {}
        # (22 unchanged attributes hidden)


      ~ environment {
          - variables = {
              - "PROJECT"           = "domain-protect"
              - "SLACK_CHANNEL"     = "monitoring"
              - "SLACK_EMOJI"       = ":warning:"
              - "SLACK_FIX_EMOJI"   = ":white_check_mark:"
              - "SLACK_NEW_EMOJI"   = ":octagonal_sign:"
              - "SLACK_USERNAME"    = "Domain Protect"
              - "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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"
            } -> null
        }


        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.data.archive_file.lambda_zip["current"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      ~ id                  = "7bd34f76573f3c577fe2dcacc86bc412e5ad8e2e" -> (known after apply)
      ~ output_base64sha256 = "h650EC4543SwYF8srS68dsUBuvq2cwm41OeF4a4Ts5E=" -> (known after apply)
      ~ output_md5          = "40cebe291760e34ca4460dc7a6bdb23e" -> (known after apply)
      ~ output_sha          = "7bd34f76573f3c577fe2dcacc86bc412e5ad8e2e" -> (known after apply)
      ~ output_size         = 10459 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda.data.archive_file.lambda_zip["update"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      ~ id                  = "22301eb916ecd315af35cd31a6700f1ec94e9e8d" -> (known after apply)
      ~ output_base64sha256 = "P2EQ3PWIDDtC4N2Jkfgd7IF/47MKTGdrn/MhmJQyirY=" -> (known after apply)
      ~ output_md5          = "187832cf5b35fadff5635d048f63b64e" -> (known after apply)
      ~ output_sha          = "22301eb916ecd315af35cd31a6700f1ec94e9e8d" -> (known after apply)
      ~ output_size         = 10704 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.lambda["current"] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-current-dev"
      ~ last_modified                  = "2022-05-03T14:49:52.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-current-dev:3" -> (known after apply)
      ~ source_code_hash               = "h650EC4543SwYF8srS68dsUBuvq2cwm41OeF4a4Ts5E=" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (18 unchanged attributes hidden)


      ~ environment {
          + variables = {
              + "ALLOWED_REGIONS"          = "['eu-central-1', 'eu-west-1', 'us-east-1']"
              + "EXTERNAL_ID"              = ""
              + "IP_TIME_LIMIT"            = "48"
              + "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              + "PROJECT"                  = "domain-protect"
              + "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              + "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              + "TERRAFORM_WORKSPACE"      = "dev"
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.lambda["update"] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-update-dev"
      ~ last_modified                  = "2022-05-03T14:49:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-update-dev:3" -> (known after apply)
      ~ source_code_hash               = "P2EQ3PWIDDtC4N2Jkfgd7IF/47MKTGdrn/MhmJQyirY=" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (18 unchanged attributes hidden)


      ~ environment {
          + variables = {
              + "ALLOWED_REGIONS"          = "['eu-central-1', 'eu-west-1', 'us-east-1']"
              + "EXTERNAL_ID"              = ""
              + "IP_TIME_LIMIT"            = "48"
              + "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              + "PROJECT"                  = "domain-protect"
              + "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              + "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              + "TERRAFORM_WORKSPACE"      = "dev"
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "4543709504766974302" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2022-05-04T09:08:57Z"
        } -> (known after apply) # forces replacement
    }

  # module.lambda-accounts.data.archive_file.lambda_zip["accounts"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      ~ id                  = "717a8849a02cbb6e54cf58e58a012005d6536656" -> (known after apply)
      ~ output_base64sha256 = "rgt1REPaO00U+WOxCOXriVqVzn+adsE1SlCoPNnMhPQ=" -> (known after apply)
      ~ output_md5          = "4a11b2235a48b0f6145ef9af47487677" -> (known after apply)
      ~ output_sha          = "717a8849a02cbb6e54cf58e58a012005d6536656" -> (known after apply)
      ~ output_size         = 10399 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda-accounts.aws_lambda_function.lambda["accounts"] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-accounts-dev"
      ~ last_modified                  = "2022-05-03T14:49:26.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-accounts-dev:3" -> (known after apply)
      ~ source_code_hash               = "rgt1REPaO00U+WOxCOXriVqVzn+adsE1SlCoPNnMhPQ=" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (18 unchanged attributes hidden)


      ~ environment {
          + variables = {
              + "EXTERNAL_ID"              = ""
              + "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              + "PROJECT"                  = "domain-protect"
              + "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              + "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              + "STATE_MACHINE_ARN"        = "arn:aws:states:eu-central-1:650869176880:stateMachine:domain-protect-scan-dev"
              + "TERRAFORM_WORKSPACE"      = "dev"
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-accounts.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "5913568364995122719" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2022-05-04T09:08:57Z"
        } -> (known after apply) # forces replacement
    }

  # module.lambda-scan.data.archive_file.lambda_zip["scan"] will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      ~ id                  = "5f54bdb5caa868944c4e5b6449247abc0603b715" -> (known after apply)
      ~ output_base64sha256 = "2z6b9iqLw4LSznGkw3E2ivqPDB7dw2gbUfEi9ztbLFU=" -> (known after apply)
      ~ output_md5          = "b588e2b04e14642b7336fc0c9f670aeb" -> (known after apply)
      ~ output_sha          = "5f54bdb5caa868944c4e5b6449247abc0603b715" -> (known after apply)
      ~ output_size         = 11740 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda-scan.aws_lambda_function.lambda["scan"] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "domain-protect-scan-dev"
      ~ last_modified                  = "2022-05-03T14:49:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-scan-dev:3" -> (known after apply)
      ~ source_code_hash               = "2z6b9iqLw4LSznGkw3E2ivqPDB7dw2gbUfEi9ztbLFU=" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (18 unchanged attributes hidden)


      ~ environment {
          + variables = {
              + "BUGCROWD"                 = "disabled"
              + "BUGCROWD_API_KEY"         = ""
              + "BUGCROWD_EMAIL"           = ""
              + "BUGCROWD_STATE"           = "unresolved"
              + "EXTERNAL_ID"              = ""
              + "ORG_PRIMARY_ACCOUNT"      = "694487085170"
              + "PRODUCTION_WORKSPACE"     = "prd"
              + "PROJECT"                  = "domain-protect"
              + "SECURITY_AUDIT_ROLE_NAME" = "domain-protect-audit"
              + "SNS_TOPIC_ARN"            = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev"
              + "TERRAFORM_WORKSPACE"      = "dev"
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.lambda-scan.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "980172503461919411" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2022-05-04T09:08:57Z"
        } -> (known after apply) # forces replacement
    }

  # module.lambda-slack.data.archive_file.lambda_zip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda_zip"  {
      ~ id                  = "e4123ecbeaf007359c5e73375bf470c6c77fcd4e" -> (known after apply)
      ~ output_base64sha256 = "Jl7//UtpvUGMIGUIduqHVW1MoZ0lbNANSdLtpwd1kw8=" -> (known after apply)
      ~ output_md5          = "0445fcf9d17ce609a68e8ae373cc1d0e" -> (known after apply)
      ~ output_sha          = "e4123ecbeaf007359c5e73375bf470c6c77fcd4e" -> (known after apply)
      ~ output_size         = 2030 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.lambda-slack.aws_lambda_alias.lambda[0] must be replaced
-/+ resource "aws_lambda_alias" "lambda" {
      ~ arn              = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-slack-monitoring-dev:domain-protect-slack-monitoring-dev" -> (known after apply)
      ~ description      = "Alias for domain-protect-monitoring-dev" -> "Alias for domain-protect-monitoring_poc-dev"
      ~ function_name    = "domain-protect-slack-monitoring-dev" -> "domain-protect-slack-monitoring_poc-dev" # forces replacement
      ~ id               = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-slack-monitoring-dev:domain-protect-slack-monitoring-dev" -> (known after apply)
      ~ invoke_arn       = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-slack-monitoring-dev:domain-protect-slack-monitoring-dev/invocations" -> (known after apply)
      ~ name             = "domain-protect-slack-monitoring-dev" -> "domain-protect-slack-monitoring_poc-dev" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.lambda-slack.aws_lambda_function.lambda[0] must be replaced
-/+ resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-slack-monitoring-dev" -> (known after apply)
      ~ description                    = "domain-protect Lambda function posting to monitoring Slack channel" -> "domain-protect Lambda function posting to monitoring_poc Slack channel"
      ~ function_name                  = "domain-protect-slack-monitoring-dev" -> "domain-protect-slack-monitoring_poc-dev" # forces replacement
      ~ id                             = "domain-protect-slack-monitoring-dev" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-slack-monitoring-dev/invocations" -> (known after apply)
      ~ last_modified                  = "2022-05-04T08:38:24.904+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-slack-monitoring-dev:1" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "Jl7//UtpvUGMIGUIduqHVW1MoZ0lbNANSdLtpwd1kw8=" -> (known after apply)
      ~ source_code_size               = 2030 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "1" -> (known after apply)
        # (10 unchanged attributes hidden)


      ~ environment {
          + variables = {
              + "PROJECT"           = "domain-protect"
              + "SLACK_CHANNEL"     = "monitoring_poc"
              + "SLACK_EMOJI"       = ":warning:"
              + "SLACK_FIX_EMOJI"   = ":white_check_mark:"
              + "SLACK_NEW_EMOJI"   = ":octagonal_sign:"
              + "SLACK_USERNAME"    = "Domain Protect"
              + "SLACK_WEBHOOK_URL" = "https://hooks.slack.com/services/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"
            }
        }

      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.lambda-slack.aws_lambda_permission.sns[0] must be replaced
-/+ resource "aws_lambda_permission" "sns" {
      ~ function_name = "domain-protect-slack-monitoring-dev" -> "domain-protect-slack-monitoring_poc-dev" # forces replacement
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda-slack.aws_sns_topic_subscription.lambda_subscription[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "lambda_subscription" {
      ~ arn                             = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev:a3754b23-586c-4ed8-b81c-d857c0123cee" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:eu-central-1:650869176880:function:domain-protect-slack-monitoring-dev" -> (known after apply) # forces replacement
      ~ id                              = "arn:aws:sns:eu-central-1:650869176880:domain-protect-dev:a3754b23-586c-4ed8-b81c-d857c0123cee" -> (known after apply)
      ~ owner_id                        = "650869176880" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda-slack.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "7855684661557853489" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2022-05-04T09:08:57Z"
        } -> (known after apply) # forces replacement
    }

Plan: 8 to add, 4 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
